Revit API Introduction Labs
LabUtils.GetOrCreateSharedParamsDefinition Method
 Helper to get shared params definition.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static Definition GetOrCreateSharedParamsDefinition(
	DefinitionGroup defGroup,
	ParameterType defType,
	string defName,
	bool visible
)
Visual Basic (Declaration)
Public Shared Function GetOrCreateSharedParamsDefinition ( _
	defGroup As DefinitionGroup, _
	defType As ParameterType, _
	defName As String, _
	visible As Boolean _
) As Definition
Visual C++
public:
static Definition^ GetOrCreateSharedParamsDefinition(
	DefinitionGroup^ defGroup,
	ParameterType defType,
	String^ defName,
	bool visible
)
Parameters
defGroup
Type: DefinitionGroup
defType
Type: ParameterType
defName
Type: System.String
visible
Type: System.Boolean
See Also
LabUtils Class
Labs Namespace